{"inkVersion":19,"root":[["^>>> !CharEnter(Noelani); CharEnter(Ocean);","\n","^>>> TextboxEnter(Default, WavesDecorationSprite);","\n","^Ocean: Hey Noelani… are you doing alright? ",{"#":"concerned(eyes), neutral(mouth)"},"\n","ev","str","^“Tell the Ocean the truth”","/str","/ev",{"*":"0.c-0","flg":20},"ev","str","^“Tell the Ocean you’re fine”","/str","/ev",{"*":"0.c-1","flg":20},{"c-0":["^ ","\n","^Noelani: No… I really miss Astra. ",{"#":"Sad"},"\n","^Ocean: Ah, I see… it’s been almost a month since she left, hasn’t it?","\n","^Noelani: Yeah…","\n",{"->":"0.g-0"},{"#f":5}],"c-1":["^ ","\n","^Noelani: What do you mean? I’m doing fine. No worries at all. ",{"#":"closed eyes, smile"},"\n","^Ocean: Noelani… you can say that all you want, but you’re not going to fool me. ",{"#":"grumpy, frown"},"\n","^Ocean: Tell me the truth and I swear it will help you feel better. ",{"#":"concerned, neutral"},"\n","^Noelani: Okay… It’s about Astra. ",{"#":"sad, frown"},"\n","^Noelani: I just...I miss her.","\n",{"->":"0.g-0"},{"#f":5}],"g-0":["^Noelani: Everything seemed so much more exciting with her around.","\n","^Noelani: She could find joy in the smallest things, even if we weren’t really doing anything at all… ",{"#":"sad, smile"},"\n","^Noelani: I don’t know how you and the Moon manage it.  ",{"#":"sad, neutral"},"\n","^Noelani: How do you deal with the distance?","\n","^Noelani: You guys can see each other once a month, but sometimes you’re both so busy you don’t even get that!  ",{"#":"sad, shout"},"\n","^Ocean: Lots of questions, huh? ",{"#":"closed eyes, neutral"},"\n","^Ocean: Unfortunately, you and I — among many others — are bound to this planet. ",{"#":"open eyes, neutral."},"\n","^Ocean: And despite how close the moon and stars may seem, the distance from here to where they reside is immense. ",{"#":"closed eyes, neutral"},"\n","^Ocean: Even with all of my power, getting to the heavens would probably take a few days. ",{"#":"open eyes, neutral."},"\n","^Ocean: If I took that much time off, I’d be neglecting my duties to Earth. ",{"#":"looking away, frown"},"\n","^Ocean: My Moon is much more powerful than I am, and even she has to take part of the month to store energy to make the trip down here, and to recover when she gets back. ",{"#":"closed eyes happy, laugh"},"\n","^Ocean: As much as it sucks to only see each other face to face every so often, that’s as much as we can manage. ",{"#":"sad, smile"},"\n","^Ocean: So I’m happy with what we have, even if I do feel lonely sometimes. ",{"#":"happy, smile"},"\n","^Noelani: Wait… it’d “probably” take a few days? You mean you’ve never tried? ",{"#":"shocked, open mouth(maybe shout)"},"\n","^Ocean: I took a day off to try, and only got a little more than half of the way there ",{"#":"looking away (maybe sweat), smile"},"\n","^Ocean: The water was reaching for me the whole time, slowly washing away my spire as I built it.","\n","^Ocean: I had to spend most of the next day recovering from using so much energy. ",{"#":"closed eyes (happy), laugh"},"\n","^Noelani: What if I tried? ",{"#":"looking away, neutral"},"\n","^Noelani: I’m a nymph so the extent of my duties is not as much as yours.","\n","^Noelani: Wrangling unruly waves during a storm, guiding lost creatures back to their proper place, and tending to the reef...","\n","^Noelani: I'm sure the other nymphs could cover me for a while! ",{"#":"happy, shout"},"\n","^Noelani: There’s so many of us so there’s usually not much to do anyways! ",{"#":"closed eyes, smile"},"\n","^Ocean: The sea will still reach for you and tear down your attempts. ",{"#":"concerned eyes, open mouth."},"\n","^Ocean: I can't void the flow of water either so the most I could do is keep the water slightly calmer when you start, or allow you a short moment of rest. ",{"#":"concerned eyes, frown"},"\n","^Noelani: Simple!","\n","^Noelani: I’ll just keep building faster than the waves can break it down! ",{"#":"determined, smile"},"\n","^Ocean: Noelani, building such a tower would push the limits of your powers.","\n","^Noelani: But if I try I have the chance to see her again. ",{"#":"Determined, neutral"},"\n","^Noelani: And I'd rather try and fail than live with the uncertainty. ",{"#":"Determined, frown"},"\n","^Ocean: *sigh* You’ve already set your mind to it, huh? ",{"#":"closed eyes, smile"},"\n","^Ocean: Well then, give it your all. ",{"#":"content, smile"},"\n",["done",{"#f":5,"#n":"g-1"}],{"#f":5}]}],"done",{"#f":1}],"listDefs":{}}