{"inkVersion":19,"root":[["^>>> !CharEnter(Moon); CharEnter(Astra);","\n","^>>> TextboxEnter(Default, StarsDecorationSprite);","\n","^Moon: why are you so focused on what love means?","\n","^Moon: Yet only limiting it as something you give to others?","\n","^Astra: I can’t exactly give something to myself can I?","\n","^Moon: Why not?","\n","^Moon: Love must come from somewhere, doesn’t it?","\n","^Moon: Make some for yourself and aim it towards yourself","\n","^Astra: ...","\n","^Moon: You seem to be focusing on your love for another to distract from looking at yourself... why?","\n","^Moon: Is having love for oneself so forgien to you? What do you not want to see?","\n","^Astra: ...","\n","^Astra: I...","\n","^Astra: After I... Burned Out... when I was stuck down on earth...","\n","^Astra: I was scared... frustrated... worried that all my potential and work to be great would be lost...","\n","^Astra: but after a while,  part of me was... relieved.","\n","^Astra: It was... freeing being able to do nothing.","\n","^Astra: It was relaxing-- which is SO weird.","\n","^Astra: I’ve only ever felt relaxed after I made huge strides in being Bright.","\n","^Astra: But I got the same feeling after making NO progress???","\n","^Astra: It’s confusing.","\n","^Astra: I’ve worked so hard for so long to live up to being the “Best and Brightest the night had to offer”...","\n","^Astra: But now success seems...less defined???","\n","^Astra: I’ll have to work just as hard to stay Bright.","\n","^Astra: I enjoy the results I get from all my work, but trying to push myself as hard as I did before just… feels harder/more pointless.","\n","^Astra: [Astra reaches the conclusion that reaching her goals in a sustainable way is better than pushing herself to be fully productive all the time]","\n","^Moon: That’s very wise, [Moon compliments Astra for her growth]","\n","^Astra: [starts talking about her time on the island/ noelani]","\n","^Astra: Meeting others so relaxed was strange, too.","\n","^Astra: They worked when they needed too, but usually they just… took it easy?","\n","^Astra: And talked to each other?","\n","^Astra: I hadn’t realized how long its been since I talked to anyone else but you, Moon.","\n","^Astra: It was hard being stuck down there with no else I knew, but once I got to know Noelani...","\n","^Astra: It got so much easier.","\n","^Astra: She’s easy to talk to, and cool, and funny--","\n","^Astra: I dont think I’ve laughed as much as I did in the month down on earth in years up here.","\n","^Moon: ahh, the little sea nymph that came to see you off?","\n","^Astra: [Waxes on a bit more about Noelani]","\n","^Moon: Dawww, you’re very clearly smitten with this little nymph.","\n","^Moon: you remind me of when I first meet the ocean…","\n","^Astra: [blush overlay]","\n","^Moon: such a courageous little nymph! Determined too, given that she’s almost here…","\n","^Astra: Yeah she’s great...","\n","^Astra: wait what do you mean she is almost here?","\n",[[{"->":"0.g-0"},{"#f":5,"#n":"g-0"}],null],["done",{"#f":5,"#n":"g-0"}],null],"done",{"#f":1}],"listDefs":{}}