{"inkVersion":19,"root":[["^>>> TextboxEnter(Default);","\n","^>>> !CharEnter(Noelani, left); CharEnter(Ocean, right);","\n","^Ocean: Great work Noelani, you’re almost to the point where I had to stop when I tried to climb. ",{"#":"ocean_happy_MeganChau"},"\n","^Ocean: Unfortunately, I have to return to the island now. I should warn you: as you continue to build this tower, you're going to encounter more resistance than just waves. ",{"#":"ocean_longing_MeganChau"},"\n","^Ocean: The winds were another obstacle I encountered when I attempted to reach my Moon. It’s about to get more difficult, but just remember why you’re doing this.","\n","^Ocean: Good Luck! I believe in you! ",{"#":"ocean_happy_MeganChau"},"\n","^>>> !CharExit(Ocean)","\n","^Noelani: Why am I doing this?... I’m not totally sure. I want to see Astra, but it’s also more than that… It just feels like something I need to do. It’s important to me… I guess I sound like Astra right now: ",{"#":"Noelani_pensive"},"\n","^>>> TextboxExit();","\n","^>>> FadeBlack(1); Wait(1); !CharExit(Noelani); MoveBackground(0, 600, 0); FadeBlack(0.2);","\n","^>>> TextboxEnter(Default);","\n","^>>> !CharEnter(Noelani, left); CharEnter(Astra, right);","\n","^Noelani: Hey, Astra… I’ve been wondering… ",{"#":"Noelani_pensive"},"\n","^Noelani:Why do you even want to be a Bright star?","\n","^Astra: I’m not totally sure. It just feels like something I need to do. It’s important to me… I want to be able to live up to the best I can be. Even if the work is hard, it’s fulfilling when I make progress. ",{"#":"AstraQuestioning_GriffinConway"},"\n","^Noelani: Is such constant hard work really the best way to go about, though? It’s good to be hard working, but if you push yourself too far then you really don't get anywhere.","\n","^Astra:... ",{"#":"AstraSad_GriffinConway"},"\n","^Noelani: And it sounds like being a Bright star just means you need to work even harder? What's the reward here? Work really hard and then double the work? That sounds so exhausting","\n","^Noelani: I might not be the best person to ask about hard work though. I can only find the focus to work hard when I’m really into something. The other nymphs even call me Happy Go Lucky Noelani.","\n","^Noelani: But, enough about what I think. Besides working to be bright, what other things do you love to do? Don’t you have any other passions?",{"#":"Noelani_happy"},"\n","^Astra: … Umm… Define “Love”?",{"#":"AstraQuestioning_GriffinConway"},"\n","^Noelani: Really?",{"#":"Noelani_pensive"},"\n","^Astra: … yes.",{"#":"AstraSurprised_GriffinConway"},"\n","^Noelani: Okay, uhh, something that sparks joy--you could do it for hours and never get tired of it.",{"#":"Noelani_determined"},"\n","^Astra: Hmm… I love… learning new things? Moon’s so knowledgeable about things down on earth… and I like listening to her talk about stuff?",{"#":"AstraQuestioning_GriffinConway"},"\n","^Noelani: Great! Kinda studious, but still, sounds cool! Anything else? ",{"#":"Noelani_happy"},"\n","^Astra: … I love hanging out with you.",{"#":"AstraHappy_GriffinConway"},"\n","^Noelani: H-huh? What do you mean?",{"#":"Noelani_pensive"},"\n","^Noelani: AAAAAAA I hope she can’t see me blushing ",{"#":"text_italics"},"\n","^Astra: You're really easy to talk to, and sweet to people you don’t even know. You tell fun jokes, and even explain them to me when I don't get them. You’re really passionate about stuff, but also really chill too.",{"#":"AstraSurprised_GriffinConway"},"\n","^Astra: you're an amazing person, Noelani. ",{"#":"AstraHappy_GriffinConway"},"\n","^>>> TextboxExit();","\n","^>>> FadeBlack(1); CharExit(Astra); Wait(1); MoveBackground(0, 100, 0); FadeBlack(0);","\n","^>>> TextboxEnter(Default);","\n","^Noelani: *sigh* It’s time to be the person Astra believes I am. ",{"#":"Noelani_determined"},"\n",["done",{"#f":5,"#n":"g-0"}],null],"done",{"#f":1}],"listDefs":{}}